<a href="https://colab.research.google.com/github/songqsh/MA2210/blob/main/src/BigM_for_Equality.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Big M for the equality constraints
- With WG example

In [1]:
# import package
import numpy as np
import numpy.linalg as la
float_formatter = "{:.2f}".format
np.set_printoptions(formatter={'float_kind':float_formatter})
import pandas as pd
import warnings
#ignore by message
warnings.filterwarnings("ignore", message="divide by zero encountered in true_divide")

## Pivotizing

Pivotizing with $(i,j)$-entry means converting the matrix by multiple EROS so that the resulting matrix has all zeros in $j$-column, but one in $(i,j)$-entry. This is the key step in updating basic feasible solution.

In [2]:
#pivotize with (i,j)
def pivot(A, i, j):
  A[i] = A[i]/A[i,j] #scale to get one in (i,j)
  n_rows, _ = A.shape
  for k in range(n_rows):
    if k==i:
      continue # skip i-row
    A[k] = A[k] - A[i]*A[k,j] # replacement to get zero

In [3]:
# input initial tableau
M = 1000

A = np.array([
               [1, -3, -5, 0, 0, M, 0], 
               [0, 1, 0, 1, 0, 0, 4], 
               [0, 0, 2, 0, 1, 0, 12],
               [0, 3, 2, 0, 0, 1, 18]
               ], dtype = float)
m, n = A.shape
m = m-1
n = n-2
print(f'{m} constraints and {n} variables')

pd.DataFrame(A) # print matrix

3 constraints and 5 variables

     0    1    2    3    4       5     6
0  1.0 -3.0 -5.0  0.0  0.0  1000.0   0.0
1  0.0  1.0  0.0  1.0  0.0     0.0   4.0
2  0.0  0.0  2.0  0.0  1.0     0.0  12.0
3  0.0  3.0  2.0  0.0  0.0     1.0  18.0

In [4]:
pivot(A, 3, 5)
pd.DataFrame(A)

     0       1       2    3    4    5        6
0  1.0 -3003.0 -2005.0  0.0  0.0  0.0 -18000.0
1  0.0     1.0     0.0  1.0  0.0  0.0      4.0
2  0.0     0.0     2.0  0.0  1.0  0.0     12.0
3  0.0     3.0     2.0  0.0  0.0  1.0     18.0

Q: Should we continue?
A: continue with col #1

In [5]:
#minimum ratio test
ratio_list = np.divide(A[:, 6], A[:, 1])
print(ratio_list)

[5.99 4.00 inf 6.00]

Q: What is the pivot row? A: pivot row = 1

In [6]:
pivot(A, 1, 1)
pd.DataFrame(A)

     0    1       2       3    4    5       6
0  1.0  0.0 -2005.0  3003.0  0.0  0.0 -5988.0
1  0.0  1.0     0.0     1.0  0.0  0.0     4.0
2  0.0  0.0     2.0     0.0  1.0  0.0    12.0
3  0.0  0.0     2.0    -3.0  0.0  1.0     6.0

Q: pivot column ? A: 2

In [7]:
#minimum ratio test
ratio_list = np.divide(A[:, 6], A[:, 2])
print(ratio_list)

[2.99 inf 6.00 3.00]

Q: pivot row? A: 3

In [8]:
pivot(A, 3, 2)
pd.DataFrame(A)

     0    1    2    3    4       5     6
0  1.0  0.0  0.0 -4.5  0.0  1002.5  27.0
1  0.0  1.0  0.0  1.0  0.0     0.0   4.0
2  0.0  0.0  0.0  3.0  1.0    -1.0   6.0
3  0.0  0.0  1.0 -1.5  0.0     0.5   3.0

Q: pivot column? A: 3

In [9]:
#minimum ratio test
ratio_list = np.divide(A[:, 6], A[:, 3])
print(ratio_list)

[-6.00 4.00 2.00 -2.00]

In [14]:
# Q: pivot row? A: 2
pivot(A, 2, 3)
pd.DataFrame(A)

     0    1    2    3         4            5     6
0  1.0  0.0  0.0  0.0  1.500000  1001.000000  36.0
1  0.0  1.0  0.0  0.0 -0.333333     0.333333   2.0
2  0.0  0.0  0.0  1.0  0.333333    -0.333333   2.0
3  0.0  0.0  1.0  0.0  0.500000     0.000000   6.0